In [1]:
import pandas as pd
import numpy as np

### adding row into the column

In [2]:
arr1 = {
    "Name" : ["yash", "Kunal", "rohit", "sanjana"], 
    "Education" : ["B.E", "ME", "BA", "MA"],
    "Designation": ["DS", "Engineer", "Mpsc", "Upsc"]
}

In [3]:
df1 = pd.DataFrame(arr1)

In [4]:
display(df1)

      Name Education Designation
0     yash       B.E          DS
1    Kunal        ME    Engineer
2    rohit        BA        Mpsc
3  sanjana        MA        Upsc

In [5]:
arr2 = {
    "Name": "sara", "Education": "M.E", "Designation": "ML" 
}

In [6]:
df1 = df1.append(arr2, ignore_index=True)

C:\Users\yashd\AppData\Local\Temp\ipykernel_4004\778167942.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = df1.append(arr2, ignore_index=True)

In [7]:
df1

      Name Education Designation
0     yash       B.E          DS
1    Kunal        ME    Engineer
2    rohit        BA        Mpsc
3  sanjana        MA        Upsc
4     sara       M.E          ML

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         5 non-null      object
 1   Education    5 non-null      object
 2   Designation  5 non-null      object
dtypes: object(3)
memory usage: 248.0+ bytes

In [9]:
df1.shape

(5, 3)

In [10]:
df1.columns.tolist()

['Name', 'Education', 'Designation']

In [11]:
df1.columns.tolist()

['Name', 'Education', 'Designation']

In [12]:
df1.columns.tolist()

['Name', 'Education', 'Designation']

In [13]:
df1.index.tolist()

[0, 1, 2, 3, 4]

In [14]:
df1.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['Name', 'Education', 'Designation'], dtype='object')]

In [15]:
df1.ndim

2

In [16]:
df1.head()

      Name Education Designation
0     yash       B.E          DS
1    Kunal        ME    Engineer
2    rohit        BA        Mpsc
3  sanjana        MA        Upsc
4     sara       M.E          ML

In [17]:
df1.tail()

      Name Education Designation
0     yash       B.E          DS
1    Kunal        ME    Engineer
2    rohit        BA        Mpsc
3  sanjana        MA        Upsc
4     sara       M.E          ML

In [18]:
df1.size

15

In [19]:
df1.shape

(5, 3)

In [20]:
df1.dtypes

Name           object
Education      object
Designation    object
dtype: object

In [21]:
n_arr = np.random.randint(1,15,size=[3,3])

In [22]:
df = pd.DataFrame(n_arr)

In [23]:
df

    0   1   2
0   9   7  11
1  11  10   4
2  13   1   3

In [24]:
df.dtypes

0    int32
1    int32
2    int32
dtype: object

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int32
 1   1       3 non-null      int32
 2   2       3 non-null      int32
dtypes: int32(3)
memory usage: 164.0 bytes

In [26]:
df[0:3]

    0   1   2
0   9   7  11
1  11  10   4
2  13   1   3

In [27]:
df[0]

0     9
1    11
2    13
Name: 0, dtype: int32

In [28]:
df[1]

0     7
1    10
2     1
Name: 1, dtype: int32

In [29]:
df[2]

0    11
1     4
2     3
Name: 2, dtype: int32

In [30]:
df

    0   1   2
0   9   7  11
1  11  10   4
2  13   1   3

In [31]:
df[0][1]

11

In [32]:
df[0][2]

13

In [33]:
df[2][2]

3

In [34]:
df[2][0] = 100

In [35]:
df

    0   1    2
0   9   7  100
1  11  10    4
2  13   1    3

In [36]:
df1

      Name Education Designation
0     yash       B.E          DS
1    Kunal        ME    Engineer
2    rohit        BA        Mpsc
3  sanjana        MA        Upsc
4     sara       M.E          ML

In [37]:
df1["Name"]

0       yash
1      Kunal
2      rohit
3    sanjana
4       sara
Name: Name, dtype: object

In [38]:
df1[0:1]

   Name Education Designation
0  yash       B.E          DS

In [39]:
df1["Education"][2] = "Engineer"

In [40]:
df1

      Name Education Designation
0     yash       B.E          DS
1    Kunal        ME    Engineer
2    rohit  Engineer        Mpsc
3  sanjana        MA        Upsc
4     sara       M.E          ML

In [41]:
ar = np.random.randint(1,10,size=[3,3])

In [42]:
fd = pd.DataFrame(ar,columns=["Num1","Num2","Num3"], index=["n1","n2","n3"])

In [43]:
fd

    Num1  Num2  Num3
n1     1     2     3
n2     7     6     7
n3     1     8     4

In [44]:
fd[0:1]

    Num1  Num2  Num3
n1     1     2     3

In [45]:
fd[0:3]

    Num1  Num2  Num3
n1     1     2     3
n2     7     6     7
n3     1     8     4

### Accessing Multiple Columns

In [46]:
fd[["Num1","Num2","Num3"]] = 1

In [47]:
fd

    Num1  Num2  Num3
n1     1     1     1
n2     1     1     1
n3     1     1     1

In [48]:
df1

      Name Education Designation
0     yash       B.E          DS
1    Kunal        ME    Engineer
2    rohit  Engineer        Mpsc
3  sanjana        MA        Upsc
4     sara       M.E          ML

In [49]:
df1[['Name', "Education", "Designation"]]

      Name Education Designation
0     yash       B.E          DS
1    Kunal        ME    Engineer
2    rohit  Engineer        Mpsc
3  sanjana        MA        Upsc
4     sara       M.E          ML

### Accesing single Column

In [50]:
df1[["Name"]]

      Name
0     yash
1    Kunal
2    rohit
3  sanjana
4     sara

### df.iloc()
### df.loc()

## 1. df.iloc()

In [51]:
df1.iloc[0:2,0:2]

    Name Education
0   yash       B.E
1  Kunal        ME

In [52]:
df1.iloc[0:2,0:3]

    Name Education Designation
0   yash       B.E          DS
1  Kunal        ME    Engineer

### 2. df.loc[]

In [53]:
df1.loc[2:5,["Name","Designation"]]

      Name Designation
2    rohit        Mpsc
3  sanjana        Upsc
4     sara          ML

In [55]:
df1.loc[3:4,["Education"]]

  Education
3        MA
4       M.E

In [56]:
fd

    Num1  Num2  Num3
n1     1     1     1
n2     1     1     1
n3     1     1     1